<a href="https://colab.research.google.com/github/Katbut/Homework/blob/main/Libraries_hw1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
print('Вычисления с помощью Numpy')
print('Задание1')
import numpy as np
a = np.array([[1, 6],
[2, 8,],
[3, 11,],
[3, 10,],
[1, 7,]])
print(a)
print("Количество наблюдений,признаков {}".format(a.shape))
N= a.shape


print("Средние значения : {}".format(a.mean(axis=0)))

mean_a= a.mean(axis=0)
print('')
print('Задание 2')

a_centered = np.subtract(a, mean_a)
print('Частное массивов исходного и среднего')
print (a_centered)

print('')
print('Задание 3')
a1=a_centered[:,0]
a2=a_centered[:,1]
a_centered_sp=np.dot(a1,a2)
print(a_centered_sp)
N=a.shape[0]
print(N)
my_cov=a_centered_sp/(N-1)
print("My_cov:", my_cov)

print('')
print('Задание 4')
np.cov(a.transpose())
print('For commit str111')

Вычисления с помощью Numpy
Задание1
[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]
Количество наблюдений,признаков (5, 2)
Средние значения : [2.  8.4]

Задание 2
Частное массивов исходного и среднего
[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

Задание 3
8.0
5
My_cov: 2.0

Задание 4
For commit str

# Вычисления с Pandas

In [11]:
import pandas as pd

a= {
    "author_id": [1,2,3],
    "author_name":['Тургенев','Чехов','Островский']
}
authors=pd.DataFrame(a)

authors

b ={
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title":['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price":[450, 300, 350, 500, 450, 370, 290]
}
books = pd.DataFrame(b)

books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [16]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')

authors_price

top5 = books.nlargest(5, "price")
top5

   author_id         book_title  price
3          2   Толстый и тонкий    500
0          1        Отцы и дети    450
4          2    Дама с собачкой    450
5          3              Гроза    370
2          1  Дворянское гнездо    350

In [17]:

df1 = authors_price.groupby('author_name').agg({'price': 'min'}).rename(columns={'price':'min_price'})

df2 = authors_price.groupby('author_name').agg({'price': 'max'}).rename(columns={'price':'max_price'})

df3 = authors_price.groupby('author_name').agg({'price': 'mean'}).rename(columns={'price':'mean_price'})

authors_stat=pd.concat([df1, df2, df3], axis = 1)

authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

In [ ]:
#Вопрос- Можно ли написать последнее задание как-то по-другому? В таком виде не работает, немного не понимаю почему.
col1=authors["author_id"]
col2=books["price"].min()
col3=books["price"].max()
col4=books["price"].mean()
c ={
    "author_name": [col1],
    "min_price":[col2],
    "max_price":[col3],
    "mean_price":[col4]
}
authors_stat=pd.DataFrame(c)
authors_stat